28/data/attachments/38d465adb2d46397.txt

URL: http://www.advantageonlineshopping.com:80/accountservice/ws
SOAP request : 
<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="com.advantage.online.store.accountservice">
    <x:Header/>
    <x:Body>
        <com:AccountLoginRequest>
            <com:loginUser>Rubzv</com:loginUser>
            <com:email>Rubzv@email.com</com:email>
            <com:loginPassword>Hjfsy968</com:loginPassword>
        </com:AccountLoginRequest>
    </x:Body>
</x:Envelope>
SOAP Response: 
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns2:AccountLoginResponse xmlns:ns2="com.advantage.online.store.accountservice">
            <ns2:StatusMessage>
                <ns2:success>true</ns2:success>
                <ns2:userId>953649059</ns2:userId>
                <ns2:reason>Login Successful</ns2:reason>
                <ns2:token>eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpc3MiOiJ3d3cuYWR2YW50YWdlb25saW5lc2hvcHBpbmcuY29tIiwidXNlcklkIjo5NTM2NDkwNTksInN1YiI6IlJ1Ynp2Iiwicm9sZSI6IlVTRVIifQ.WVmUZVXYsLKjFkmA4qNAufPTa4svC2UpjeMGH6MPZuw</ns2:token>
                <ns2:sessionId>189edf8f09f@7E78D8112A^i%953649059</ns2:sessionId>
                <ns2:t_authorization>UnVienY6SGpmc3k5Njg=</ns2:t_authorization>
                <ns2:accountType>20</ns2:accountType>
            </ns2:StatusMessage>
        </ns2:AccountLoginResponse>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
